Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ06GS202A.h
#define _RPINR18_U1CTSR5_POSITION                0x0000000D
#define _RPINR18_U1CTSR5_MASK                    0x00002000
#define _RPINR18_U1CTSR5_LENGTH                  0x00000001

#define _RPINR20_SDI1R_POSITION                  0x00000000
#define _RPINR20_SDI1R_MASK                      0x0000003F
#define _RPINR20_SDI1R_LENGTH                    0x00000006

#define _RPINR20_SCK1R_POSITION                  0x00000008
#define _RPINR20_SCK1R_MASK                      0x00003F00
#define _RPINR20_SCK1R_LENGTH                    0x00000006

#define _RPINR20_SDI1R0_POSITION                 0x00000000
#define _RPINR20_SDI1R0_MASK                     0x00000001
#define _RPINR20_SDI1R0_LENGTH                   0x00000001

#define _RPINR20_SDI1R1_POSITION                 0x00000001
#define _RPINR20_SDI1R1_MASK                     0x00000002
#define _RPINR20_SDI1R1_LENGTH                   0x00000001

#define _RPINR20_SDI1R2_POSITION                 0x00000002
#define _RPINR20_SDI1R2_MASK                     0x00000004
#define _RPINR20_SDI1R2_LENGTH                   0x00000001

#define _RPINR20_SDI1R3_POSITION                 0x00000003
#define _RPINR20_SDI1R3_MASK                     0x00000008
#define _RPINR20_SDI1R3_LENGTH                   0x00000001

#define _RPINR20_SDI1R4_POSITION                 0x00000004
#define _RPINR20_SDI1R4_MASK                     0x00000010
#define _RPINR20_SDI1R4_LENGTH                   0x00000001

#define _RPINR20_SDI1R5_POSITION                 0x00000005
#define _RPINR20_SDI1R5_MASK                     0x00000020
#define _RPINR20_SDI1R5_LENGTH                   0x00000001

#define _RPINR20_SCK1R0_POSITION                 0x00000008
#define _RPINR20_SCK1R0_MASK                     0x00000100
#define _RPINR20_SCK1R0_LENGTH                   0x00000001

#define _RPINR20_SCK1R1_POSITION                 0x00000009
#define _RPINR20_SCK1R1_MASK                     0x00000200
#define _RPINR20_SCK1R1_LENGTH                   0x00000001

#define _RPINR20_SCK1R2_POSITION                 0x0000000A
#define _RPINR20_SCK1R2_MASK                     0x00000400
#define _RPINR20_SCK1R2_LENGTH                   0x00000001

#define _RPINR20_SCK1R3_POSITION                 0x0000000B
#define _RPINR20_SCK1R3_MASK                     0x00000800
#define _RPINR20_SCK1R3_LENGTH                   0x00000001

#define _RPINR20_SCK1R4_POSITION                 0x0000000C
#define _RPINR20_SCK1R4_MASK                     0x00001000
#define _RPINR20_SCK1R4_LENGTH                   0x00000001

#define _RPINR20_SCK1R5_POSITION                 0x0000000D
#define _RPINR20_SCK1R5_MASK                     0x00002000
#define _RPINR20_SCK1R5_LENGTH                   0x00000001

#define _RPINR21_SS1R_POSITION                   0x00000000
#define _RPINR21_SS1R_MASK                       0x0000003F
#define _RPINR21_SS1R_LENGTH                     0x00000006

#define _RPINR21_SS1R0_POSITION                  0x00000000
#define _RPINR21_SS1R0_MASK                      0x00000001
#define _RPINR21_SS1R0_LENGTH                    0x00000001

#define _RPINR21_SS1R1_POSITION                  0x00000001
#define _RPINR21_SS1R1_MASK                      0x00000002
#define _RPINR21_SS1R1_LENGTH                    0x00000001

#define _RPINR21_SS1R2_POSITION                  0x00000002
#define _RPINR21_SS1R2_MASK                      0x00000004
#define _RPINR21_SS1R2_LENGTH                    0x00000001

#define _RPINR21_SS1R3_POSITION                  0x00000003
#define _RPINR21_SS1R3_MASK                      0x00000008
#define _RPINR21_SS1R3_LENGTH                    0x00000001

#define _RPINR21_SS1R4_POSITION                  0x00000004
#define _RPINR21_SS1R4_MASK                      0x00000010
#define _RPINR21_SS1R4_LENGTH                    0x00000001

#define _RPINR21_SS1R5_POSITION                  0x00000005
#define _RPINR21_SS1R5_MASK                      0x00000020
#define _RPINR21_SS1R5_LENGTH                    0x00000001

#define _RPINR29_FLT1R_POSITION                  0x00000008
#define _RPINR29_FLT1R_MASK                      0x00003F00
#define _RPINR29_FLT1R_LENGTH                    0x00000006

#define _RPINR29_FLT1R0_POSITION                 0x00000008
#define _RPINR29_FLT1R0_MASK                     0x00000100
#define _RPINR29_FLT1R0_LENGTH                   0x00000001

#define _RPINR29_FLT1R1_POSITION                 0x00000009
#define _RPINR29_FLT1R1_MASK                     0x00000200
#define _RPINR29_FLT1R1_LENGTH                   0x00000001

#define _RPINR29_FLT1R2_POSITION                 0x0000000A
#define _RPINR29_FLT1R2_MASK                     0x00000400
#define _RPINR29_FLT1R2_LENGTH                   0x00000001

#define _RPINR29_FLT1R3_POSITION                 0x0000000B
#define _RPINR29_FLT1R3_MASK                     0x00000800
#define _RPINR29_FLT1R3_LENGTH                   0x00000001

#define _RPINR29_FLT1R4_POSITION                 0x0000000C
#define _RPINR29_FLT1R4_MASK                     0x00001000
#define _RPINR29_FLT1R4_LENGTH                   0x00000001

#define _RPINR29_FLT1R5_POSITION                 0x0000000D
#define _RPINR29_FLT1R5_MASK                     0x00002000
#define _RPINR29_FLT1R5_LENGTH                   0x00000001

#define _RPINR30_FLT2R_POSITION                  0x00000000
#define _RPINR30_FLT2R_MASK                      0x0000003F
#define _RPINR30_FLT2R_LENGTH                    0x00000006

#define _RPINR30_FLT3R_POSITION                  0x00000008
#define _RPINR30_FLT3R_MASK                      0x00003F00
#define _RPINR30_FLT3R_LENGTH                    0x00000006

#define _RPINR30_FLT2R0_POSITION                 0x00000000
#define _RPINR30_FLT2R0_MASK                     0x00000001
#define _RPINR30_FLT2R0_LENGTH                   0x00000001

#define _RPINR30_FLT2R1_POSITION                 0x00000001
#define _RPINR30_FLT2R1_MASK                     0x00000002
#define _RPINR30_FLT2R1_LENGTH                   0x00000001

#define _RPINR30_FLT2R2_POSITION                 0x00000002
#define _RPINR30_FLT2R2_MASK                     0x00000004
#define _RPINR30_FLT2R2_LENGTH                   0x00000001

#define _RPINR30_FLT2R3_POSITION                 0x00000003
#define _RPINR30_FLT2R3_MASK                     0x00000008
#define _RPINR30_FLT2R3_LENGTH                   0x00000001

#define _RPINR30_FLT2R4_POSITION                 0x00000004
#define _RPINR30_FLT2R4_MASK                     0x00000010
#define _RPINR30_FLT2R4_LENGTH                   0x00000001

#define _RPINR30_FLT2R5_POSITION                 0x00000005
#define _RPINR30_FLT2R5_MASK                     0x00000020
#define _RPINR30_FLT2R5_LENGTH                   0x00000001

#define _RPINR30_FLT3R0_POSITION                 0x00000008
#define _RPINR30_FLT3R0_MASK                     0x00000100
#define _RPINR30_FLT3R0_LENGTH                   0x00000001

#define _RPINR30_FLT3R1_POSITION                 0x00000009
#define _RPINR30_FLT3R1_MASK                     0x00000200
#define _RPINR30_FLT3R1_LENGTH                   0x00000001

#define _RPINR30_FLT3R2_POSITION                 0x0000000A
#define _RPINR30_FLT3R2_MASK                     0x00000400
#define _RPINR30_FLT3R2_LENGTH                   0x00000001

